tap "homebrew/bundle"
tap "homebrew/core"
tap "supabase/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Collection of Linux utilities
brew "util-linux"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Generic syntax highlighter
brew "pygments"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Access X11 clipboards from the command-line
brew "xclip"
# Supabase CLI
brew "supabase/tap/supabase"
